STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_Privacy_Peripheral/STM32_WPAN/App/app_ble.c
/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

/**
  * @brief Callback called by the BLE stack (from BleStack_Process() context)
  * to send an indication to the application. The indication is a BLE standard
  * packet that can be either an ACI/HCI event or an ACL data.
  * @param data: pointer to the data of the packet
  * @param length: length of the data of the packet
  * @param ext_data: pointer to the extended data
  * @param ext_length: extended data length
  * @retval Status of the operation
  */

tBleStatus BLECB_Indication( const uint8_t* data,
                          uint16_t length,
                          const uint8_t* ext_data,
                          uint16_t ext_length )
{
  uint8_t status = BLE_STATUS_FAILED;
  BleEvtPacket_t *phcievt = NULL;
  uint16_t total_length = (length+ext_length);

  UNUSED(ext_data);

  /* USER CODE BEGIN BLECB_Indication */

  /* USER CODE END BLECB_Indication */

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    BLE_EVENTS_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
    if (AMM_Alloc (CFG_AMM_VIRTUAL_BLE_EVENTS,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   &BLE_EVENTS_ResumeFlowProcessCb) != AMM_ERROR_OK)
    {
      LOG_INFO_APP("Alloc failed\n");
      status = BLE_STATUS_FAILED;
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      MEMCPY( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      UTIL_SEQ_SetTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SEQ_PRIO_0);
      status = BLE_STATUS_SUCCESS;
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
    status = BLE_STATUS_SUCCESS;
  }
  return status;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
void configure_filter_and_resolving_list()
{
  tBleStatus ret;
  
  Bonded_Device_Entry_t Bonded_Devices_Entry[20];
  uint8_t nb_bonded_devices;
  List_Entry_t List_Entry[20];
  uint8_t i;

  /* Get the bonded device identity address and type */
  ret = aci_gap_get_bonded_devices(&nb_bonded_devices, Bonded_Devices_Entry);
  if (nb_bonded_devices > 0)
  {
    for (i=0; i<nb_bonded_devices;i++)
    {
      List_Entry[i].Address_Type = Bonded_Devices_Entry[i].Address_Type;
      memcpy(List_Entry[i].Address, Bonded_Devices_Entry[i].Address, 6);
    }
    
    /* Append to both resolving list and Filter Accept List */
    ret = aci_gap_add_devices_to_list(nb_bonded_devices,List_Entry, 0x04);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : aci_gap_add_devices_to_list command, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("  Success: aci_gap_add_devices_to_list command\n");
    }

  }  
}

void Terminate_Connection_After_Bonding()
{
  tBleStatus ret;
  
  if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER)
  {
    ret = aci_gap_terminate(bleAppContext.connectionHandle, 0x13);
    if (ret != BLE_STATUS_SUCCESS)
    {
       APP_DBG_MSG("aci_gap_terminate failure: reason=0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_terminate : Success\n");
      gap_cmd_resp_wait();/* waiting for HCI_DISCONNECTION_COMPLETE_EVT_CODE */
    }
  }
  
  UTIL_SEQ_SetTask( 1U << CFG_TASK_CONFIGURE_FILTER_RESOLVING_LIST, CFG_SEQ_PRIO_0); 
  
  return;
}

void advertise_filter_accept_list()
{
  tBleStatus ret;
  /* Start Advertising */
  ret = aci_gap_set_undirected_connectable(CONN_INT_MS(50),
                                           CONN_INT_MS(100),
                                           CFG_BD_ADDRESS_TYPE,
                                           HCI_SCAN_FILTER_ACC_LIST_USED_EXT);
  
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("==>> aci_gap_set_undirected_connectable - fail, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("==>> aci_gap_set_undirected_connectable - Success\n");
  }
  
  ret = aci_gap_delete_ad_type(AD_TYPE_TX_POWER_LEVEL);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("==>> delete tx power level - fail, result: 0x%02X\n", ret);
  }
  
  /* Update Advertising data */
  uint8_t *adv_data_p;
  uint8_t adv_data_len;
  
  adv_data_p = &a_AdvData[0];
  adv_data_len = sizeof(a_AdvData);
  /* USER CODE BEGIN ADV_DATA_UPDATE_1 */
  
  /* USER CODE END ADV_DATA_UPDATE_1 */
  ret = aci_gap_update_adv_data(adv_data_len, adv_data_p);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("==>> Start Advertising Failed, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("==>> Success: Start Advertising\n");
  }
}

#if (CFG_BUTTON_SUPPORTED == 1)
void APP_BSP_Button1Action(void)
{
  tBleStatus ret;
  uint8_t nb_bonded_devices;
  Bonded_Device_Entry_t Bonded_Devices_Entry[20];
  
  ret = aci_gap_get_bonded_devices(&nb_bonded_devices, Bonded_Devices_Entry);
  if (ret != BLE_STATUS_SUCCESS) 
  {
    APP_DBG_MSG("  Fail   : aci_gap_get_bonded_devices() failed:0x%02X\r\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_gap_get_bonded_devices; N: %d\n", nb_bonded_devices);
    if (nb_bonded_devices>=1)
    {
      UTIL_SEQ_SetTask( 1U << CFG_TASK_TERMINATE_CONNECTION_AFTER_BONDING, CFG_SEQ_PRIO_0); 
    }
    else
    {
      if (bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
      {
        /* Start advertising */
        APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
        UTIL_TIMER_StartWithPeriod(&bleAppContext.Advertising_mgr_timer_Id, ADV_TIMEOUT_MS);
      }
    }
  }
  return;
}

void APP_BSP_Button2Action(void)
{
  tBleStatus ret;
  
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_SERVER)
  {
    /* Clear Security Database */
    ret = aci_gap_clear_security_db();
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("==>> aci_gap_clear_security_db - Fail, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("==>> aci_gap_clear_security_db - Success\n");
    }
  }
  return;
}

void APP_BSP_Button3Action(void)
{
  /* Advertise with Filter list active */
  UTIL_SEQ_SetTask( 1U << CFG_TASK_ADV_FILTER_LIST, CFG_SEQ_PRIO_0);
}
#endif
/* USER CODE END FD_WRAP_FUNCTIONS */
